#Dev : @YY8HH

HELP_1 = """✓**<u>- اوامر الادمن:</u>**



**c** تعني  تشغيل في القناه.

/pause or /cpause • إيقاف تشغيل الموسيقى مؤقتا.
/resume or /cresume • استئناف الموسيقى المتوقفة مؤقتا.
/mute or /cmute • كتم صوت الموسيقى المشغلة.
/unmute or /cunmute • إلغاء كتم صوت الموسيقى الصامتة.
/skip or /cskip • تخطي تشغيل الموسيقى الحالية.
/stop or /cstop- إيقاف تشغيل الموسيقى.
/shuffle or /cshuffle • خلط قائمة التشغيل في قائمة الانتظار عشوائيا.
/seek or /cseek • إعادة توجيه البحث عن الموسيقى إلى المدة الخاصة بك
/seekback or /cseekback • إلى الوراء ابحث عن الموسيقى إلى المدة التي تقضيها
/restart • إعادة تشغيل بوت للدردشة الخاصة بك .

✓<u>**تخطي محدد:**</u>

/skip or /cskip [الرقم (مثال: 3)] 
- يتخطى الموسيقى إلى رقم محدد في قائمة الانتظار. مثل: /skip 3 سوف تخطي الموسيقى إلى الموسيقى الثالثة في قائمة الانتظار وسوف تتجاهل الموسيقى 1 و 2 في قائمة الانتظار.

✓<u>**دوارات التشغــيل:**</u>

/loop or /cloop [تمكين/تعطيل] أو [أرقام بين 1-10] 
- عند تنشيطه ، يقوم الروبوت بتكرار تشغيل الموسيقى الحالية إلى 1-10 مرات في الدردشة الصوتية. افتراضي إلى 10 مرات.


✓<u>**المستخدمون المصدقون :**</u>

المطرودين يمكن للمستخدمين استخدام اوامــر المسؤول بدون حقوق المسؤول في الدردشة.
/auth [معرف المستخدم] • إضافة مستخدم إلى قائمة المطرودين الخاصة بالمجموعة.
/unauth [معرف المستخدم] • إزالة مستخدم من قائمة المطرودين للمجموعة.
/authusers - تحقق من قائمة المصادقة للمجموعة."""


HELP_2 = """✓<u>**اوامر التشغيل:**</u>

الاوامر المتوفرة = play , vplay , cplay
Force اوامر التشغيل = playforce , vplayforce , cplayforce

**c** اوامر تشغيل في القناه.
**v** لتشغيل   الفيديو.
**force** stands for force play.
/play or /vplay or /cplay  • سيبدأ Bot في تشغيل استعلامك المحدد على الدردشة الصوتية أو بث الروابط المباشرة على الدردشات الصوتية.
/playforce or /vplayforce or /cplayforce •  **يؤدي فرض التشغيل** إلى إيقاف مسار التشغيل الحالي في الدردشة الصوتية وبدء تشغيل المسار الذي تم البحث عنه على الفور دون إزعاج/مسح قائمة الانتظار.
/channelplay [معرف القناه او ايدي القناه] أو [تعطيل] - يمكنك ربط القناة بمجموعة وبث الموسيقى على الدردشة الصوتية للقناة من مجموعتك.


✓**<u>قوائم تشغيل خادم البوت:</u>**

/playlist • تحقق من قائمة التشغيل المحفوظة على الخوادم.
/deleteplaylist • حذف أي موسيقى محفوظة في قائمة التشغيل
/play • ابدء تشغيل قائمة التشغيل المحفوظة من الخوادم."""

HELP_3 = """✓<u>**اوامر البوت :**</u>

/stats • احصل على أفضل 10 مسارات إحصائيات عالمية ، وأفضل 10 مستخدمين للبوت ، وأفضل 10 دردشات على الروبوت ، وأفضل 10 دردشات تم لعبها في دردشة وما إلى ذلك.
/sudolist • تحقق من قائمه المطورين
/lyrics [اسم الموسيقى] • يبحث في كلمات الأغاني عن موسيقى معينة على الويب.
/song [اسم المسار] أو [رابط YT] • قم بتنزيل أي مسار من youtube بتنسيقات mp3 أو mp4.
/player -  احصل على لوحة تشغيل تفاعلية.

**c** تعني  تشغيل في القناه.

/queue or /cqueue • تحقق من قائمة انتظار الموسيقى."""
HELP_4 = """✓<u>**اوامر إضافية:**</u>

/start - بدء تشغيل بوت الموسيقى.
/help  - احصل على قائمة مساعد الاوامــر مع تفسيرات مفصلة للاوامــر.
/ping- بنك بوت والتحقق من ذاكرة الوصول العشوائي، وحدة المعالجة المركزية الخ احصائيات بوت.

✓<u>**إعدادات المجموعة:**</u>

/settings • الحصول على إعدادات كاملة للمجموعة باستخدام الأزرار المضمنة

🔗 **الخيارات في الإعدادات:**
𝟏 يمكنك تعيين ** جودة الصوت ** التي تريد بثها على الدردشة الصوتية.

𝟐 يمكنك تعيين ** جودة الفيديو ** تريد البث على الدردشة الصوتية.

𝟑 ** مصادقة المستخدمين **: - يمكنك تغيير وضع اوامــر المسؤول من هنا إلى الجميع أو المسؤولين فقط. إذا كان الجميع ، فسيتمكن أي شخص موجود في مجموعتك من استخدام اوامــر المسؤول (مثل /skip, /stop، إلخ)

𝟒 ** الوضع النظيف: ** عند تمكينه ، يحذف رسائل الروبوت بعد 5 دقائق من مجموعتك للتأكد من أن الدردشة تظل نظيفة وجيدة.

𝟓 **قيادة نظيفة** : عند تنشيطه، سيقوم بوت بحذف الاوامــر المنفذة (/play, /pause, /shuffle, /stop etc) فورا.

𝟔 **اعدادات التشغيل:**

/playmode - احصل على لوحة إعدادات تشغيل كاملة مع أزرار حيث يمكنك تعيين إعدادات تشغيل مجموعتك. 

<u>الخيارات في وضع التشغيل:</u>

𝟏 **وضع البحث** [مباشر أو مضمن] • يغير وضع البحث أثناء تقديم /play مود. 

𝟐 **اوامــر المسؤول** [الجميع أو المسؤولون] • إذا كان الجميع، فسيتمكن أي شخص موجود في مجموعتك من استخدام اوامــر المسؤول (مثل /skip, /stop etc)

𝟑 **نوع التشغيل** [الجميع أو المشرفون] • إذا كان المسؤولون ، فيمكن للمسؤولين الموجودين في المجموعة فقط تشغيل الموسيقى على الدردشة الصوتية"""

HELP_5 = """🔰**<u>إضافة وإزالة مطورين :</u>**

/addsudo [معرف المستخدم or الرد على مستخدم]
/delsudo [معرف المستخدم or الرد على مستخدم]

🛃**<u>هيروكو:</u>**
/usage - Dyno Usage.

🌐**<u>فارات التكوين:</u>**

/get_var - احصل على نسخة فار من Heroku أو .env.
/del_var - حذف أي var على Heroku أو .env.
/set_var [اسم فار] [القيمة] - تعيين Var أو تحديث Var على heroku أو .env. فصل Var وقيمته بمساحة.

🤖**<u> اوامر البوت:</u>**

/reboot - إعادة تشغيل الروبوت الخاص بك. 
/update - تحديث البوت.
/speedtest - التحقق من سرعات الخادم
/maintenance [تمكين / تعطيل] 
/logger [تمكين / تعطيل] - يقوم Bot بتسجيل الاستعلامات التي تم البحث عنها في مجموعة المسجل.
/get_log [Number of Lines] - احصل على سجل الروبوت الخاص بك من heroku أو VPS. يعمل لكليهما.

📈**<u>اوامر الإحصائيات:</u>**

/activevoice - تحقق من الدردشات الصوتية النشطة على الروبوت.
/activevideo - تحقق من مكالمات الفيديو النشطة على الروبوت.
/stats - تحقق من إحصائيات الروبوتات

⚠️**<u>القائمة السوداء وظيفة الدردشة:</u>**

/blacklistchat [معرف القناه] - القائمة السوداء لأي دردشة من استخدام Music Bot
/whitelistchat [معرف القناه] - القائمة البيضاء لأي دردشة مدرجة في القائمة السوداء من استخدام Music Bot
/blacklistedchat - التحقق من جميع الدردشات المدرجة في القائمة السوداء.

👤**<u>وظيفة محظورة:</u>**

/block [معرف المستخدم or الرد على مستخدم] - يمنع المستخدم من استخدام اوامــر الروبوت.
/unblock [معرف المستخدم or الرد على مستخدم] - إزالة مستخدم من القائمة المحظورة للبوت.
/blockedusers - التحقق من قوائم المستخدمين المحظورين

👤**<u>اوامــر العــام:</u>**

/gban [معرف المستخدم or الرد على مستخدم] - حظر مستخدم من الدردشة التي يخدمها الروبوت ومنعه من استخدام الروبوت الخاص بك.
/ungban [معرف المستخدم or الرد على مستخدم] - إزالة مستخدم من قائمة gban الخاصة ب Bot والسماح له باستخدام برنامج الروبوت الخاص بك
/gbannedusers - التحقق من قوائم المستخدمين المحظورين

🎥**<u>وظيفة مكالمات الفيديو:</u>**

/set_video_limit [عدد الدردشات] - تعيين الحد الأقصى لعدد الدردشات المسموح بها لمكالمات الفيديو في المرة الواحدة. افتراضي ل 3 دردشات.
/videomode [download|m3u8] - إذا تم تمكين وضع التنزيل ، فسيقوم Bot بتنزيل مقاطع الفيديو بدلا من تشغيلها في نموذج M3u8. ByDefault إلى M3u8. يمكنك استخدام وضع التنزيل عند عدم تشغيل أي استعلام في وضع m3u8.

⚡️**<u>وظيفة بوت خاصة:</u>**

/authorize [معرف القناه] - السماح بالدردشة لاستخدام الروبوت الخاص بك.
/unauthorize [معرف القناه] - عدم السماح للدردشة باستخدام الروبوت الخاص بك.
/authorized - تحقق من جميع الدردشات المسموح بها من الروبوت الخاص بك.

🌐**<u>وظيفة البث:</u>**

/broadcast [رسالة أو الرد على رسالة] - بث أي رسالة إلى الدردشات المعروضة في برنامج البوت.

<u>خيارات البث:</u>

**-pin** : سيؤدي ذلك إلى تثبيت رسالتك 
**-pinloud** : سيؤدي ذلك إلى تثبيت رسالتك بإشعار بصوت عال
**-user** : سيؤدي ذلك إلى بث رسالتك إلى المستخدمين الذين بدأوا تشغيل برنامج الروبوت الخاص بك
**-assistant** : سيؤدي الى بث رسالتك من الحساب المساعد
**-nobot** : سيؤدي ذلك إلى إجبار الروبوت الخاص بك على عدم بث الرسالة

**مثال:** `/broadcast -user -assistant -pin Hello Testing`



"""
